/* -------------------------------------------------------------------------
//	文件名		：	kconnectsocket.h
//	创建者		：	luobaohang
//	创建时间	：	2010/6/12 11:49:08
//	功能描述	：	
//
// -----------------------------------------------------------------------*/
#ifndef __KCONNECTSOCKET_H__
#define __KCONNECTSOCKET_H__

// -------------------------------------------------------------------------
class KConnectSocket
{
public:
	KConnectSocket(void);
	~KConnectSocket(void);
};

// -------------------------------------------------------------------------

#endif /* __KCONNECTSOCKET_H__ */
