
local preEnv = _G;
setfenv(1, Arena);

-- 场景id
ARENA_SCENE = 232;

MAX_CHALLENGE_TIMES = 20;	-- 挑战次数上限
MAX_WIN_COMBO_AWARD = 50;   -- 最高50连胜 

ENTER_POS =
{
	--7458, 1187, 1064467
	1326 + 100, 3700, 1053545,
};

-- 非前5名站位
STAND_POS = {
	{1107, 5137, 1065185},
	{1274, 5082, 1065175},
	{1457, 5045, 1065169},
	{1644, 5063, 1065195},
	{1816, 5107, 1065164},  -- pos 5
};

-- 前五5名站位
TOP5_POS = {
  {1822, 4844, 105257}, --排名：5
	{1131, 4831, 105185}, --排名：4
	{1646, 4829, 105185}, --排名：3
	{1287, 4829, 105120}, --排名：2
	{1468, 4686, 105119}, --排名：1
}

tbComboAward =
{
	[0] = 1,
	[1] = 5,
	[5] = 10,
	[10] = 15,
	[15] = 20,
	[20] = 25,
	[25] = 30,
	[30] = 35,
	[35] = 40,
	[40] = 45,
	[45] = 50,
};

emARENA_AWARD_WIN = 1;
emARENA_AWARD_LOSE = 2;

preEnv.setfenv(1, preEnv);
